cases/pipe_simulation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "3/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1276;
        startFace       1332056;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1276;
        startFace       1333332;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32396;
        startFace       1334608;
    }
)

// ************************************************************************* //
